In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv("C:\Code Files\Project\Bangalore_Housing_Price\BHP.csv")

<>:1: SyntaxWarning: invalid escape sequence '\C'
<>:1: SyntaxWarning: invalid escape sequence '\C'
C:\Users\Manan\AppData\Local\Temp\ipykernel_22720\2935885803.py:1: SyntaxWarning: invalid escape sequence '\C'
  df = pd.read_csv("C:\Code Files\Project\Bangalore_Housing_Price\BHP.csv")

In [3]:
df.shape

(13320, 9)

In [4]:
df.head()

,\area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
print(df.columns.tolist())

['\\area_type', 'availability', 'location', 'size', 'society', 'total_sqft', 'bath', 'balcony', 'price']


DROP THE FEATURES WHICH ARE IRRELEVANT TO US

In [6]:
df = df.drop(
    ['\\area_type', "availability", "society",'balcony'], axis=1
)  # no use as what do we have to do with what society it is in

FILL THE VALUES WHICH ARE NOT PRESENT IN THE DATA

In [7]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [8]:
df = df.dropna()

In [9]:
df["size"] = df["size"].str.extract('(\d+)')
df["size"] = df["size"].astype(int)
df.rename(columns={'size': 'BHK'}, inplace = True)
df.head()

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Manan\AppData\Local\Temp\ipykernel_22720\2344312147.py:1: SyntaxWarning: invalid escape sequence '\d'
  df["size"] = df["size"].str.extract('(\d+)')

                   location  BHK total_sqft  bath   price
0  Electronic City Phase II    2       1056   2.0   39.07
1          Chikka Tirupathi    4       2600   5.0  120.00
2               Uttarahalli    3       1440   2.0   62.00
3        Lingadheeranahalli    3       1521   3.0   95.00
4                  Kothanur    2       1200   2.0   51.00

Feature Engineering

In [10]:
def convert_sqft(val):
    try:
        if "-" in val:  # for values like 1100 - 1200
            token = val.split("-")  # splits those two parts into 1100 and 1200 separate 
            return (float(token[0]) + float[token[1]]) / 2 # takes the avg 
        return float(val) # if the value is 1100 then simply converts into a a float value 1100.00
    except:
        return None

df['total_sqft'] = df['total_sqft'].apply(convert_sqft)
df = df.dropna(subset=['total_sqft'])

In [ ]:
df = df.reset_index(drop=True) # when we drop from the main dataframe, sometimes what happens is few rows dissapear and the indexes go missing, so we reset them

In [12]:
df.shape

(13056, 5)

In [13]:
df = df[(df["BHK"] <= 10) & (df["price"] <= 500)]  # or try 1000 for broader view

In [14]:
df.head()

                   location  BHK  total_sqft  bath   price
0  Electronic City Phase II    2      1056.0   2.0   39.07
1          Chikka Tirupathi    4      2600.0   5.0  120.00
2               Uttarahalli    3      1440.0   2.0   62.00
3        Lingadheeranahalli    3      1521.0   3.0   95.00
4                  Kothanur    2      1200.0   2.0   51.00

In [15]:
# # BHK vs Price

# plt.figure(figsize = (16, 5))
# plt.subplot(1, 2, 1)
# plt.scatter(df['BHK'] , df["price"], alpha=0.3)
# plt.xlim(0.5, 10.5)
# plt.xticks(range(1, 11))
# plt.xlabel('BHK')
# plt.ylabel('Price')
# plt.title("BHK vs Price")
# plt.grid(True, axis = 'y', linestyle = '--', alpha = 0.3)
# plt.show()


# avg_price = df.groupby('BHK')['price'].mean().reset_index()
# plt.figure(figsize=(16, 5))
# sns.barplot(data = avg_price, x ='BHK', y = 'price',color= 'red')
# plt.xlim(0.5, 10.5)
# plt.xticks(range(1, 11))
# plt.xlabel("BHK")
# plt.ylabel("Price")
# plt.title("BHK vs Price")
# plt.grid(True, axis="y", linestyle="--", alpha=0.3)
# plt.tight_layout()
# plt.show()

# df["price_per_sqft"] = (df["price"] * 100000 / df["total_sqft"])  # assuming price in lakhs

# plt.figure(figsize=(10, 5))
# sns.boxplot(x="BHK", y="price_per_sqft", data=df)
# plt.title("Price per Sqft across BHKs")
# plt.grid(True, axis="y", linestyle="--", alpha=0.3)
# plt.show()

In [16]:
df.loc[30]

location      Bisuvanahalli
BHK                       3
total_sqft           1075.0
bath                    2.0
price                  35.0
Name: 30, dtype: object

In [17]:
df.shape

(12807, 5)

In [18]:
df2 = df.copy()

df2["price_per_sqft"] = df2["price"] * 100000 / df2["total_sqft"]

In [19]:
df2.shape

(12807, 6)

In [20]:
df2.head(10)

                    location  BHK  total_sqft  bath   price  price_per_sqft
0   Electronic City Phase II    2      1056.0   2.0   39.07     3699.810606
1           Chikka Tirupathi    4      2600.0   5.0  120.00     4615.384615
2                Uttarahalli    3      1440.0   2.0   62.00     4305.555556
3         Lingadheeranahalli    3      1521.0   3.0   95.00     6245.890861
4                   Kothanur    2      1200.0   2.0   51.00     4250.000000
5                 Whitefield    2      1170.0   2.0   38.00     3247.863248
6           Old Airport Road    4      2732.0   4.0  204.00     7467.057101
8               Marathahalli    3      1310.0   3.0   63.25     4828.244275
9               Gandhi Bazar    6      1020.0   6.0  370.00    36274.509804
10                Whitefield    3      1800.0   2.0   70.00     3888.888889

In [21]:
len(df.location.unique())

1271

In [ ]:
df2 = df2.location.apply(lambda x: x.strip()) #a small anonymous function, strip basically takes the spaces off